# Panda 2D- DataFrame Part 3

### Built In Functions for dataFrame

* **Dataframe.applymap()**

Applies function to each element of Dataframe and return new dataframe

Examples :

In [1]:
import pandas as pd

In [5]:
df = pd.DataFrame({
        'a': [1, 2, 3],
        'b': [10, 20, 30],
        'c': [5, 10, 15]
    })
print(df)
print('***')
def add_one(x):
    return x + 1
print('Result after applymap()')
df.applymap(add_one)

   a   b   c
0  1  10   5
1  2  20  10
2  3  30  15
***
Result after applymap()

   a   b   c
0  2  11   6
1  3  21  11
2  4  31  16

***
Fill in this function to convert the given DataFrame of numerical
    grades to letter grades. Return a new DataFrame with the converted
    grade.
    
    The conversion rule is:
        90-100 -> A
        80-89  -> B
        70-79  -> C
        60-69  -> D
        0-59   -> F

In [6]:
grades_df = pd.DataFrame(
    data={'exam1': [43, 81, 78, 75, 89, 70, 91, 65, 98, 87],
          'exam2': [24, 63, 56, 56, 67, 51, 79, 46, 72, 60]},
    index=['Andre', 'Barry', 'Chris', 'Dan', 'Emilio', 
           'Fred', 'Greta', 'Humbert', 'Ivan', 'James']
)
print(grades_df)

         exam1  exam2
Andre       43     24
Barry       81     63
Chris       78     56
Dan         75     56
Emilio      89     67
Fred        70     51
Greta       91     79
Humbert     65     46
Ivan        98     72
James       87     60

In [7]:
def convert_grades(grade):
    if grade >= 90:
        return 'A'
    elif grade >=80:
        return 'B'
    elif grade >= 70:
        return 'C'
    elif grade >= 60:
        return 'D'
    elif grade >= 0:
        return 'F'

In [8]:
grades_df.applymap(convert_grades)

        exam1 exam2
Andre       F     F
Barry       B     D
Chris       C     F
Dan         C     F
Emilio      B     D
Fred        C     F
Greta       A     C
Humbert     D     F
Ivan        A     C
James       B     D

***
### DataFrame.apply()

This functions different than Series.apply()

Apply function to each element.<br>
In Df.Apply(), each element = each column of Dataframe i.e. panda series
return new panda series which is new column of Data frame<br>

Also takes axis argument .apply(axis = 0)

In [15]:
grades_df = pd.DataFrame(
    data={'exam1': [43, 81, 78, 75, 89, 70, 91, 65, 98, 87],
          'exam2': [24, 63, 56, 56, 67, 51, 79, 46, 72, 60]},
    index=['Andre', 'Barry', 'Chris', 'Dan', 'Emilio', 
           'Fred', 'Greta', 'Humbert', 'Ivan', 'James']
)
print(grades_df)

         exam1  exam2
Andre       43     24
Barry       81     63
Chris       78     56
Dan         75     56
Emilio      89     67
Fred        70     51
Greta       91     79
Humbert     65     46
Ivan        98     72
James       87     60

**.qcut()**
Pandas has a bult-in function that will perform this calculation
- This will give the bottom 0% to 10% of students the grade 'F',
- 10% to 20% the grade 'D', and so on. 
- You can read more about the qcut() function here:<br>
- qcut() operates on a list, array, or Series
- Returns the result of running the function on a single column of dataframe
- qcut() does not work on Dataframe, but we can use apply() to call this function on each column separately
 http://pandas.pydata.org/pandas-docs/stable/generated/pandas.qcut.html

In [17]:
def convert_grades_curve(exam_grades):
    return pd.qcut(exam_grades,[0, 0.1, 0.2, 0.5, 0.8, 1],labels=['F', 'D', 'C', 'B', 'A'])
convert_grades_curve(grades_df['exam1'])

Andre      F
Barry      B
Chris      C
Dan        C
Emilio     B
Fred       C
Greta      A
Humbert    D
Ivan       A
James      B
Name: exam1, dtype: category
Categories (5, object): ['F' < 'D' < 'C' < 'B' < 'A']

In [23]:
convert_grades_curve(grades_df['exam2'])

Andre      F
Barry      B
Chris      C
Dan        C
Emilio     B
Fred       C
Greta      A
Humbert    D
Ivan       A
James      B
Name: exam2, dtype: category
Categories (5, object): ['F' < 'D' < 'C' < 'B' < 'A']

In [22]:
grades_df.apply(convert_grades_curve)

        exam1 exam2
Andre       F     F
Barry       B     B
Chris       C     C
Dan         C     C
Emilio      B     B
Fred        C     C
Greta       A     A
Humbert     D     D
Ivan        A     A
James       B     B

Fill in this function to standardize each column of the given
    DataFrame. To standardize a variable, convert each value to the
    number of standard deviations it is above or below the mean.

In [18]:
def standarize_column(column):
    return (column - column.mean())/column.std(ddof = 0)

In [20]:
standarize_column(grades_df['exam1'])

Andre     -2.315341
Barry      0.220191
Chris      0.020017
Dan       -0.180156
Emilio     0.753987
Fred      -0.513779
Greta      0.887436
Humbert   -0.847401
Ivan       1.354508
James      0.620538
Name: exam1, dtype: float64

In [21]:
grades_df.apply(standarize_column)

            exam1     exam2
Andre   -2.315341 -2.304599
Barry    0.220191  0.386400
Chris    0.020017 -0.096600
Dan     -0.180156 -0.096600
Emilio   0.753987  0.662400
Fred    -0.513779 -0.441600
Greta    0.887436  1.490400
Humbert -0.847401 -0.786600
Ivan     1.354508  1.007400
James    0.620538  0.179400

#### apply()
##### Use case 2
Instead of taking column and return new column , function takes column and return a single value. End result is new Series instead of new DataFrame

In [28]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
    'a': [4, 5, 3, 1, 2],
    'b': [20, 10, 40, 50, 30],
    'c': [25, 20, 5, 15, 10]
})
print(df)

   a   b   c
0  4  20  25
1  5  10  20
2  3  40   5
3  1  50  15
4  2  30  10

In [33]:
print(df.mean())
print(df.mean(axis = 0))
print(df.apply(np.mean))
print(df.apply(np.max))

a     3.0
b    30.0
c    15.0
dtype: float64
a     3.0
b    30.0
c    15.0
dtype: float64
a     3.0
b    30.0
c    15.0
dtype: float64
a     5
b    50
c    25
dtype: int64

Find the second largest in each column

In [35]:
df['a'].sort_values(ascending = False)

1    5
0    4
2    3
4    2
3    1
Name: a, dtype: int64

In [34]:
def find_second_largest(column):
    return column.sort_values(ascending = False).iloc[1]

In [36]:
df.apply(find_second_largest)

a     4
b    40
c    20
dtype: int64